#ifndef UE4SS_SDK_BS_AquaticInteractionData_HPP
#define UE4SS_SDK_BS_AquaticInteractionData_HPP

struct FBS_AquaticInteractionData
{
    float Force_10_2F4FD72F49BCBB81FA9729A268993C4D;                                  // 0x0000 (size: 0x4)
    float Torque_26_BFFA81594F81A9D829E82083436A0590;                                 // 0x0004 (size: 0x4)
    float RandomOffset_35_2B37AF5E4D20E2DF8559718620844133;                           // 0x0008 (size: 0x4)
    float Radius_12_E1550A634ADBB4EA56E2B1AE4AEDF60B;                                 // 0x000C (size: 0x4)
    float Importance_14_B5BEDFB9418E67A384EBA79581DA1AA7;                             // 0x0010 (size: 0x4)
    float MaxForce_34_6499E59046192D125441009588B75BF6;                               // 0x0014 (size: 0x4)
    float MaxDistance_29_6BEF08A8488CE3949B1C5C8AEB936920;                            // 0x0018 (size: 0x4)
    int32 SplashEmiter_53_9482201B42685C048A4C0D9D95A8BD4D;                           // 0x001C (size: 0x4)
    float SplashOffsetZ_44_5B2896334632B17A889BCC8B2D45A465;                          // 0x0020 (size: 0x4)
    float SplashEmiterScale_68_B58ED4F243C46D959CA73D81C8FC7485;                      // 0x0024 (size: 0x4)

}; // Size: 0x28

#endif
