#ifndef UE4SS_SDK_ElectricityGunStats_HPP
#define UE4SS_SDK_ElectricityGunStats_HPP

struct FElectricityGunStats
{
    float StunDuration_7_0394BE1D45B2B8C14740CA8C546AA2C2;                            // 0x0000 (size: 0x4)
    float ChainRadius_6_23ADE702442380030B06B98AC4EEA128;                             // 0x0004 (size: 0x4)
    float DamagePerShock_8_C9983DC6474A546BDAAB8EA350A6967E;                          // 0x0008 (size: 0x4)
    float DamageInterval_11_4C9560F9475747E7B731E1901C5CBD04;                         // 0x000C (size: 0x4)
    float LinetraceDistance_14_79F859FA4569696179C1B18A8EE6A987;                      // 0x0010 (size: 0x4)
    float ChargesPerFiring_16_88E323F749018064D33184B4B1C2DBFE;                       // 0x0014 (size: 0x4)
    float TotalGunCapacity_19_21655CE74CB9D8A0B0C5E993909E11A4;                       // 0x0018 (size: 0x4)
    float CurrentGunCapacity_24_00110D3D466F0AA59C6B9FAF900808BE;                     // 0x001C (size: 0x4)
    int32 ReloadTimeUpgrades_31_F314419D4198705EA0A304AC48FAE3F1;                     // 0x0020 (size: 0x4)

}; // Size: 0x24

#endif
