#ifndef UE4SS_SDK_EnemyBaseSettings_HPP
#define UE4SS_SDK_EnemyBaseSettings_HPP

struct FEnemyBaseSettings
{
    float Health_2_CFEB975743A2680657A1CF984B8B2556;                                  // 0x0000 (size: 0x4)
    float BaseDamage_4_CFCC68A54C83E7B65241368D56C3D65C;                              // 0x0004 (size: 0x4)
    bool CanRoam_7_0F5801E442E69D317727B692112DCB86;                                  // 0x0008 (size: 0x1)
    float RoamRadius_11_092B81C241F66C3FBE4A079B95AE96C4;                             // 0x000C (size: 0x4)
    bool Blind_13_D42672F340F7C52F76BE90A8CE3E18C1;                                   // 0x0010 (size: 0x1)
    bool Numb_15_190A34D04091FD9C831F36BD9FF7F5C4;                                    // 0x0011 (size: 0x1)
    bool Deaf_17_881C3B1543DEF61E9AB816BD161C6D15;                                    // 0x0012 (size: 0x1)
    bool AlwaysChasing_23_5702CC09443A7E7C910513B9E065E5B6;                           // 0x0013 (size: 0x1)
    bool CanBreakBeam_25_6D7CD290428BE7311962A3BA876947F1;                            // 0x0014 (size: 0x1)

}; // Size: 0x15

#endif
