#ifndef UE4SS_SDK_Map_HPP
#define UE4SS_SDK_Map_HPP

class AMap_C : public ALevelScriptActor
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0228 (size: 0x8)
    float Timeline_10_NewTrack_1_1297F3B04F84F107B820E9A5B1198081;                    // 0x0230 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_10__Direction_1297F3B04F84F107B820E9A5B1198081; // 0x0234 (size: 0x1)
    class UTimelineComponent* Timeline_10;                                            // 0x0238 (size: 0x8)
    float Timeline_9_NewTrack_0_F25929D94D7DC64BF5B5BFA437781705;                     // 0x0240 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_9__Direction_F25929D94D7DC64BF5B5BFA437781705; // 0x0244 (size: 0x1)
    class UTimelineComponent* Timeline_9;                                             // 0x0248 (size: 0x8)
    float Timeline_8_NewTrack_0_FB1508ED4EA9517ADDC155AB2F0D890E;                     // 0x0250 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_8__Direction_FB1508ED4EA9517ADDC155AB2F0D890E; // 0x0254 (size: 0x1)
    class UTimelineComponent* Timeline_8;                                             // 0x0258 (size: 0x8)
    float Timeline_7_NewTrack_0_FF93C71346B3570BEB5EF4B610AF4659;                     // 0x0260 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_7__Direction_FF93C71346B3570BEB5EF4B610AF4659; // 0x0264 (size: 0x1)
    class UTimelineComponent* Timeline_7;                                             // 0x0268 (size: 0x8)
    float Timeline_6_NewTrack_0_3083D3B3414EC108A3F8A9A1689DC7EF;                     // 0x0270 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_6__Direction_3083D3B3414EC108A3F8A9A1689DC7EF; // 0x0274 (size: 0x1)
    class UTimelineComponent* Timeline_6;                                             // 0x0278 (size: 0x8)
    float Timeline_2_NewTrack_0_3CC025F04D9B89FD685F27A8E2DEA08E;                     // 0x0280 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_2__Direction_3CC025F04D9B89FD685F27A8E2DEA08E; // 0x0284 (size: 0x1)
    class UTimelineComponent* Timeline_2;                                             // 0x0288 (size: 0x8)
    float Timeline_1_NewTrack_0_6BE495A348E95010F9EF5A9F98A022FF;                     // 0x0290 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_1__Direction_6BE495A348E95010F9EF5A9F98A022FF; // 0x0294 (size: 0x1)
    class UTimelineComponent* Timeline_1;                                             // 0x0298 (size: 0x8)
    float Timeline_18_NewTrack_1_F0C40912459C5FE9F0D6529B616FE383;                    // 0x02A0 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_18__Direction_F0C40912459C5FE9F0D6529B616FE383; // 0x02A4 (size: 0x1)
    class UTimelineComponent* Timeline_18;                                            // 0x02A8 (size: 0x8)
    float Timeline_17_NewTrack_1_3872777446B80F93C223F494178563AE;                    // 0x02B0 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_17__Direction_3872777446B80F93C223F494178563AE; // 0x02B4 (size: 0x1)
    class UTimelineComponent* Timeline_17;                                            // 0x02B8 (size: 0x8)
    float Timeline_16_NewTrack_1_21B523944D8BCFD05953DD8C2A485EA2;                    // 0x02C0 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_16__Direction_21B523944D8BCFD05953DD8C2A485EA2; // 0x02C4 (size: 0x1)
    class UTimelineComponent* Timeline_16;                                            // 0x02C8 (size: 0x8)
    float Timeline_15_NewTrack_1_5F0DFBE94E81B9555DE7CEBF5C676C08;                    // 0x02D0 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_15__Direction_5F0DFBE94E81B9555DE7CEBF5C676C08; // 0x02D4 (size: 0x1)
    class UTimelineComponent* Timeline_15;                                            // 0x02D8 (size: 0x8)
    float Timeline_14_NewTrack_1_2FDAC310483956A20A48E2A17C950695;                    // 0x02E0 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_14__Direction_2FDAC310483956A20A48E2A17C950695; // 0x02E4 (size: 0x1)
    class UTimelineComponent* Timeline_14;                                            // 0x02E8 (size: 0x8)
    float Timeline_28_NewTrack_1_90F1828F4E8D17D61F074ABF8BC5B099;                    // 0x02F0 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_28__Direction_90F1828F4E8D17D61F074ABF8BC5B099; // 0x02F4 (size: 0x1)
    class UTimelineComponent* Timeline_28;                                            // 0x02F8 (size: 0x8)
    float Timeline_23_move_bar_9B8CEA774DAAC3E437707BB89E265861;                      // 0x0300 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_23__Direction_9B8CEA774DAAC3E437707BB89E265861; // 0x0304 (size: 0x1)
    class UTimelineComponent* Timeline_23;                                            // 0x0308 (size: 0x8)
    float Timeline_24_NewTrack_1_330A6A6D472CD419ACEA5DB47041D2EA;                    // 0x0310 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_24__Direction_330A6A6D472CD419ACEA5DB47041D2EA; // 0x0314 (size: 0x1)
    class UTimelineComponent* Timeline_24;                                            // 0x0318 (size: 0x8)
    float Timeline_22_NewTrack_1_77A454B645E43606632A6CB9D210FFBC;                    // 0x0320 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_22__Direction_77A454B645E43606632A6CB9D210FFBC; // 0x0324 (size: 0x1)
    class UTimelineComponent* Timeline_22;                                            // 0x0328 (size: 0x8)
    float Timeline_21_NewTrack_1_B349D11442158B044188BCB79B29ABBE;                    // 0x0330 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_21__Direction_B349D11442158B044188BCB79B29ABBE; // 0x0334 (size: 0x1)
    class UTimelineComponent* Timeline_21;                                            // 0x0338 (size: 0x8)
    float Timeline_20_NewTrack_1_69195E544BAC456BF4A583BA7AE26EA0;                    // 0x0340 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_20__Direction_69195E544BAC456BF4A583BA7AE26EA0; // 0x0344 (size: 0x1)
    class UTimelineComponent* Timeline_20;                                            // 0x0348 (size: 0x8)
    float Timeline_19_NewTrack_1_EDD13C31497A6E1A23C1C09FD6032ECA;                    // 0x0350 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_19__Direction_EDD13C31497A6E1A23C1C09FD6032ECA; // 0x0354 (size: 0x1)
    class UTimelineComponent* Timeline_19;                                            // 0x0358 (size: 0x8)
    float Timeline_0_NewTrack_1_EFC65274401594D6797CB09EB6D7CA47;                     // 0x0360 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_0__Direction_EFC65274401594D6797CB09EB6D7CA47; // 0x0364 (size: 0x1)
    class UTimelineComponent* Timeline_0;                                             // 0x0368 (size: 0x8)
    float Timeline_26_NewTrack_0_6FC5C7B2470C4D2D578901B6C6BFBCB1;                    // 0x0370 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_26__Direction_6FC5C7B2470C4D2D578901B6C6BFBCB1; // 0x0374 (size: 0x1)
    class UTimelineComponent* Timeline_26;                                            // 0x0378 (size: 0x8)
    float Timeline_25_NewTrack_0_7944897947E9C79FF3ECC2BCA6E94C8C;                    // 0x0380 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_25__Direction_7944897947E9C79FF3ECC2BCA6E94C8C; // 0x0384 (size: 0x1)
    class UTimelineComponent* Timeline_25;                                            // 0x0388 (size: 0x8)
    float Timeline_5_NewTrack_0_F6C1F89F487B5784FDB5E9A1BC069CBE;                     // 0x0390 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_5__Direction_F6C1F89F487B5784FDB5E9A1BC069CBE; // 0x0394 (size: 0x1)
    class UTimelineComponent* Timeline_5;                                             // 0x0398 (size: 0x8)
    float Timeline_4_NewTrack_0_8F7FFE7F4F5D9A09592698BD6017CAAF;                     // 0x03A0 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_4__Direction_8F7FFE7F4F5D9A09592698BD6017CAAF; // 0x03A4 (size: 0x1)
    class UTimelineComponent* Timeline_4;                                             // 0x03A8 (size: 0x8)
    float Timeline_3_0to1_A0A7AED94A3CCC4AD39848801D2B5D77;                           // 0x03B0 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> Timeline_3__Direction_A0A7AED94A3CCC4AD39848801D2B5D77; // 0x03B4 (size: 0x1)
    class UTimelineComponent* Timeline_3;                                             // 0x03B8 (size: 0x8)
    float fogoff_0to1_1580A0A042485C59D468A7A4BE1586F2;                               // 0x03C0 (size: 0x4)
    TEnumAsByte<ETimelineDirection::Type> fogoff__Direction_1580A0A042485C59D468A7A4BE1586F2; // 0x03C4 (size: 0x1)
    class UTimelineComponent* fogoff;                                                 // 0x03C8 (size: 0x8)
    class AFirstPersonCharacter_C* FirstPersonCharacter;                              // 0x03D0 (size: 0x8)
    float FogDensityTemp;                                                             // 0x03D8 (size: 0x4)
    bool JumppadCheckpoint;                                                           // 0x03DC (size: 0x1)
    class AFirstPersonCharacter_C* Player;                                            // 0x03E0 (size: 0x8)
    bool Tutorialdone;                                                                // 0x03E8 (size: 0x1)
    int32 BlueGuyTalk;                                                                // 0x03EC (size: 0x4)
    float Don't Respawn Enemies before;                                               // 0x03F0 (size: 0x4)
    TArray<class ABarrelClosed_Blueprint_C*> GoldenbarrelsRemaining;                  // 0x03F8 (size: 0x10)
    TArray<class ABarrelRed_C*> RedbarrelsRemaining;                                  // 0x0408 (size: 0x10)
    float TempAirControl;                                                             // 0x0418 (size: 0x4)
    class AActor* diamondaxe;                                                         // 0x0420 (size: 0x8)
    FTransform axetransform;                                                          // 0x0430 (size: 0x30)
    TArray<class AActor*> Axes there?;                                                // 0x0460 (size: 0x10)
    TArray<class AActor*> YellowSeeds;                                                // 0x0470 (size: 0x10)
    FVector templocation;                                                             // 0x0480 (size: 0xC)
    FVector Templocation2;                                                            // 0x048C (size: 0xC)
    class ARedGuy_C* MomInTwist;                                                      // 0x0498 (size: 0x8)
    int32 GoldNuggetCount;                                                            // 0x04A0 (size: 0x4)
    bool Demo;                                                                        // 0x04A4 (size: 0x1)
    int32 correctnuggets;                                                             // 0x04A8 (size: 0x4)
    class AActor* GoldNugget;                                                         // 0x04B0 (size: 0x8)
    bool PiratedVersion;                                                              // 0x04B8 (size: 0x1)
    bool TrickRequest;                                                                // 0x04B9 (size: 0x1)
    bool TrickActive;                                                                 // 0x04BA (size: 0x1)
    bool TrickStartInBox1;                                                            // 0x04BB (size: 0x1)
    class Achest_C* Chest22_11777_ExecuteUbergraph_Map_RefProperty;                   // 0x04C0 (size: 0x8)
    class ADoor_C* Door63_2172_ExecuteUbergraph_Map_RefProperty;                      // 0x04C8 (size: 0x8)
    class ADoor3_C* Door91_ExecuteUbergraph_Map_RefProperty;                          // 0x04D0 (size: 0x8)
    class ARedGuy_C* WarnShieldGuy2_ExecuteUbergraph_Map_RefProperty;                 // 0x04D8 (size: 0x8)
    class ARedGuy_C* WarnShieldGuy5_ExecuteUbergraph_Map_RefProperty;                 // 0x04E0 (size: 0x8)
    class Achest_C* Chest145_2_ExecuteUbergraph_Map_RefProperty;                      // 0x04E8 (size: 0x8)
    class Achest_C* Chest77_4_ExecuteUbergraph_Map_RefProperty;                       // 0x04F0 (size: 0x8)
    class ABigButton_C* BigButton9_408_ExecuteUbergraph_Map_RefProperty;              // 0x04F8 (size: 0x8)
    class ATriggeredBlockingVolume_C* TorrentPirateBlocker_ExecuteUbergraph_Map_RefProperty; // 0x0500 (size: 0x8)
    class ALevelSequenceActor* CreditsSequence_2_ExecuteUbergraph_Map_RefProperty;    // 0x0508 (size: 0x8)
    class APlayerStart* PlayerStart_2_ExecuteUbergraph_Map_RefProperty;               // 0x0510 (size: 0x8)
    class ATriggeredBlockingVolume_C* TriggeredBlockingVolume12_3_ExecuteUbergraph_Map_RefProperty; // 0x0518 (size: 0x8)
    class ATriggeredBlockingVolume_C* TriggeredBlockingVolume14_8_ExecuteUbergraph_Map_RefProperty; // 0x0520 (size: 0x8)
    class ATriggeredBlockingVolume_C* TriggeredBlockingVolume13_ExecuteUbergraph_Map_RefProperty; // 0x0528 (size: 0x8)
    class ATriggeredBlockingVolume_C* TriggeredBlockingVolume15_ExecuteUbergraph_Map_RefProperty; // 0x0530 (size: 0x8)
    class ATargetPoint* TargetPoint22_3_ExecuteUbergraph_Map_RefProperty;             // 0x0538 (size: 0x8)
    class ACutSceneMode_C* CutSceneMode3_2_ExecuteUbergraph_Map_RefProperty;          // 0x0540 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook19_2_ExecuteUbergraph_Map_RefProperty;   // 0x0548 (size: 0x8)
    class ARedGuy_C* EndMom_ExecuteUbergraph_Map_RefProperty;                         // 0x0550 (size: 0x8)
    class ARedGuy_C* EndCousin_ExecuteUbergraph_Map_RefProperty;                      // 0x0558 (size: 0x8)
    class ARedGuy_C* EndPaul_ExecuteUbergraph_Map_RefProperty;                        // 0x0560 (size: 0x8)
    class ARedGuy_C* EndMiracle_ExecuteUbergraph_Map_RefProperty;                     // 0x0568 (size: 0x8)
    class ARedGuy_C* EndPavo_ExecuteUbergraph_Map_RefProperty;                        // 0x0570 (size: 0x8)
    class ARedGuy_C* RedGuy101_ExecuteUbergraph_Map_RefProperty;                      // 0x0578 (size: 0x8)
    class ARedGuy_C* RedGuy100_ExecuteUbergraph_Map_RefProperty;                      // 0x0580 (size: 0x8)
    class ARedGuy_C* EndRedGuy1_ExecuteUbergraph_Map_RefProperty;                     // 0x0588 (size: 0x8)
    class ARedGuy_C* EndBlueGuy1_ExecuteUbergraph_Map_RefProperty;                    // 0x0590 (size: 0x8)
    class ARedGuy_C* EndRedGuy2_ExecuteUbergraph_Map_RefProperty;                     // 0x0598 (size: 0x8)
    class AWalkPoint_C* WalkPoint433_ExecuteUbergraph_Map_RefProperty;                // 0x05A0 (size: 0x8)
    class ASkeletalMeshActor* MiracleStatue_ExecuteUbergraph_Map_RefProperty;         // 0x05A8 (size: 0x8)
    class AWalkPoint_C* WalkPoint434_ExecuteUbergraph_Map_RefProperty;                // 0x05B0 (size: 0x8)
    class ADoor_C* Door102_ExecuteUbergraph_Map_RefProperty;                          // 0x05B8 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume39_ExecuteUbergraph_Map_RefProperty; // 0x05C0 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume40_ExecuteUbergraph_Map_RefProperty; // 0x05C8 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume41_ExecuteUbergraph_Map_RefProperty; // 0x05D0 (size: 0x8)
    class ARedGuy_C* Mom9_ExecuteUbergraph_Map_RefProperty;                           // 0x05D8 (size: 0x8)
    class ABuySpeedx15_C* BuySpeedx15_2_ExecuteUbergraph_Map_RefProperty;             // 0x05E0 (size: 0x8)
    class ABuyChestDetectorRadius_C* BuyChestDetectorRadius_ExecuteUbergraph_Map_RefProperty; // 0x05E8 (size: 0x8)
    class ARedGuy_C* RedGuy116_ExecuteUbergraph_Map_RefProperty;                      // 0x05F0 (size: 0x8)
    class ABuyUpgradeChestNum_C* BuyUpgradeChestNum_ExecuteUbergraph_Map_RefProperty; // 0x05F8 (size: 0x8)
    class AShowHideSaveObject_C* ShowBigBoy5_ExecuteUbergraph_Map_RefProperty;        // 0x0600 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume3_812_ExecuteUbergraph_Map_RefProperty; // 0x0608 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume6_512_ExecuteUbergraph_Map_RefProperty; // 0x0610 (size: 0x8)
    class AEmitter* FallingWatersmall_10_ExecuteUbergraph_Map_RefProperty;            // 0x0618 (size: 0x8)
    class AAmbientSound* waterfalling_Cue_5_ExecuteUbergraph_Map_RefProperty;         // 0x0620 (size: 0x8)
    class AEmitter* WaterSplashLoop_3_ExecuteUbergraph_Map_RefProperty;               // 0x0628 (size: 0x8)
    class AWaterVolume_C* WaterVolume7_ExecuteUbergraph_Map_RefProperty;              // 0x0630 (size: 0x8)
    class AWaterVolume_C* WaterVolume11_ExecuteUbergraph_Map_RefProperty;             // 0x0638 (size: 0x8)
    class AWaterVolume_C* WaterVolume12_ExecuteUbergraph_Map_RefProperty;             // 0x0640 (size: 0x8)
    class AStaticMeshActor* pipe_01_60_ExecuteUbergraph_Map_RefProperty;              // 0x0648 (size: 0x8)
    class AStaticMeshActor* pipe_01_59_ExecuteUbergraph_Map_RefProperty;              // 0x0650 (size: 0x8)
    class AAmbientSound* waterfalling_Cue3_ExecuteUbergraph_Map_RefProperty;          // 0x0658 (size: 0x8)
    class AEmitter* WaterSplashLoop3_ExecuteUbergraph_Map_RefProperty;                // 0x0660 (size: 0x8)
    class AEmitter* FallingWatersmall2_ExecuteUbergraph_Map_RefProperty;              // 0x0668 (size: 0x8)
    class ARedGuy_C* BlueRoamGuy1_ExecuteUbergraph_Map_RefProperty;                   // 0x0670 (size: 0x8)
    class ARedGuy_C* BlueRoamGuy2_ExecuteUbergraph_Map_RefProperty;                   // 0x0678 (size: 0x8)
    class ARedGuy_C* BlueRoamGuy3_ExecuteUbergraph_Map_RefProperty;                   // 0x0680 (size: 0x8)
    class ARedGuy_C* BlueRoamGuy4_ExecuteUbergraph_Map_RefProperty;                   // 0x0688 (size: 0x8)
    class ARedGuy_C* BlueRoamGuy5_ExecuteUbergraph_Map_RefProperty;                   // 0x0690 (size: 0x8)
    class ARedGuy_C* RedGuy25_ExecuteUbergraph_Map_RefProperty;                       // 0x0698 (size: 0x8)
    class ARedGuy_C* RedGuy8_ExecuteUbergraph_Map_RefProperty;                        // 0x06A0 (size: 0x8)
    class ARedGuy_C* RedGuy3_3588_ExecuteUbergraph_Map_RefProperty;                   // 0x06A8 (size: 0x8)
    class ARedGuy_C* RedGuy6_ExecuteUbergraph_Map_RefProperty;                        // 0x06B0 (size: 0x8)
    class ARedGuy_C* RedGuy23_ExecuteUbergraph_Map_RefProperty;                       // 0x06B8 (size: 0x8)
    class ARedGuy_C* RedGuy24_ExecuteUbergraph_Map_RefProperty;                       // 0x06C0 (size: 0x8)
    class ARedGuy_C* RedGuy11_15595_ExecuteUbergraph_Map_RefProperty;                 // 0x06C8 (size: 0x8)
    class ARedGuy_C* RedGuy113_ExecuteUbergraph_Map_RefProperty;                      // 0x06D0 (size: 0x8)
    class ARedGuy_C* RedGuy114_ExecuteUbergraph_Map_RefProperty;                      // 0x06D8 (size: 0x8)
    class ARedGuy_C* BlueRoamGuy6_ExecuteUbergraph_Map_RefProperty;                   // 0x06E0 (size: 0x8)
    class ARedGuy_C* BlueRoamGuy7_ExecuteUbergraph_Map_RefProperty;                   // 0x06E8 (size: 0x8)
    class ARedGuy_C* RedGuy98_ExecuteUbergraph_Map_RefProperty;                       // 0x06F0 (size: 0x8)
    class ARedGuy_C* RedGuy99_ExecuteUbergraph_Map_RefProperty;                       // 0x06F8 (size: 0x8)
    class ARedGuy_C* RedGuy97_ExecuteUbergraph_Map_RefProperty;                       // 0x0700 (size: 0x8)
    class ARedGuy_C* RedGuy58_ExecuteUbergraph_Map_RefProperty;                       // 0x0708 (size: 0x8)
    class ARedGuy_C* RedGuy32_3032_ExecuteUbergraph_Map_RefProperty;                  // 0x0710 (size: 0x8)
    class ARedGuy_C* RedGuy33_ExecuteUbergraph_Map_RefProperty;                       // 0x0718 (size: 0x8)
    class ARedGuy_C* Mom10_ExecuteUbergraph_Map_RefProperty;                          // 0x0720 (size: 0x8)
    class ARedGuy_C* RedKing2_ExecuteUbergraph_Map_RefProperty;                       // 0x0728 (size: 0x8)
    class ARedGuy_C* Supraball_Character_2_ExecuteUbergraph_Map_RefProperty;          // 0x0730 (size: 0x8)
    class ARedGuy_C* Supraball_Character33_ExecuteUbergraph_Map_RefProperty;          // 0x0738 (size: 0x8)
    class ARedGuy_C* Supraball_Character31_ExecuteUbergraph_Map_RefProperty;          // 0x0740 (size: 0x8)
    class ARedGuy_C* Supraball_Character37_ExecuteUbergraph_Map_RefProperty;          // 0x0748 (size: 0x8)
    class ARedGuy_C* Supraball_Character38_ExecuteUbergraph_Map_RefProperty;          // 0x0750 (size: 0x8)
    class ARedGuy_C* Supraball_Character35_ExecuteUbergraph_Map_RefProperty;          // 0x0758 (size: 0x8)
    class ARedGuy_C* Supraball_Character9_ExecuteUbergraph_Map_RefProperty;           // 0x0760 (size: 0x8)
    class ARedGuy_C* Supraball_Character40_ExecuteUbergraph_Map_RefProperty;          // 0x0768 (size: 0x8)
    class ARedGuy_C* Supraball_Character7_13_ExecuteUbergraph_Map_RefProperty;        // 0x0770 (size: 0x8)
    class ARedGuy_C* Supraball_Character11_ExecuteUbergraph_Map_RefProperty;          // 0x0778 (size: 0x8)
    class ARedGuy_C* Supraball_Character29_ExecuteUbergraph_Map_RefProperty;          // 0x0780 (size: 0x8)
    class ARedGuy_C* Supraball_Character26_ExecuteUbergraph_Map_RefProperty;          // 0x0788 (size: 0x8)
    class ARedGuy_C* Supraball_Character21_ExecuteUbergraph_Map_RefProperty;          // 0x0790 (size: 0x8)
    class ARedGuy_C* RedKing_ExecuteUbergraph_Map_RefProperty;                        // 0x0798 (size: 0x8)
    class ARedGuy_C* Supraball_Character12_ExecuteUbergraph_Map_RefProperty;          // 0x07A0 (size: 0x8)
    class ARedGuy_C* Supraball_Character14_ExecuteUbergraph_Map_RefProperty;          // 0x07A8 (size: 0x8)
    class ARedGuy_C* Supraball_Character8_ExecuteUbergraph_Map_RefProperty;           // 0x07B0 (size: 0x8)
    class ARedGuy_C* Supraball_Character34_ExecuteUbergraph_Map_RefProperty;          // 0x07B8 (size: 0x8)
    class ARedGuy_C* Supraball_Character19_ExecuteUbergraph_Map_RefProperty;          // 0x07C0 (size: 0x8)
    class AAmbientSound* peopletalkloop_Cue_2_ExecuteUbergraph_Map_RefProperty;       // 0x07C8 (size: 0x8)
    class ARedGuy_C* Supraball_Character43_ExecuteUbergraph_Map_RefProperty;          // 0x07D0 (size: 0x8)
    class AJumppad_C* Jumppad43_2_ExecuteUbergraph_Map_RefProperty;                   // 0x07D8 (size: 0x8)
    class ABuyStats_C* BuyStats_ExecuteUbergraph_Map_RefProperty;                     // 0x07E0 (size: 0x8)
    class AWaterVolume_C* WaterVolume5_ExecuteUbergraph_Map_RefProperty;              // 0x07E8 (size: 0x8)
    class ABuyWalletx2_C* BuyWallet+51_ExecuteUbergraph_Map_RefProperty;              // 0x07F0 (size: 0x8)
    class APipeCap_C* PipeCap30_ExecuteUbergraph_Map_RefProperty;                     // 0x07F8 (size: 0x8)
    class APaperSpriteActor* map_Sprite_ExecuteUbergraph_Map_RefProperty;             // 0x0800 (size: 0x8)
    class AStaticMeshActor* SM_MERGED_Castlewall30_6104_ExecuteUbergraph_Map_RefProperty; // 0x0808 (size: 0x8)
    class ARedGuy_C* RedGuy14_2_ExecuteUbergraph_Map_RefProperty;                     // 0x0810 (size: 0x8)
    class ADestroyObjectsOnTrigger_C* DestroyObjectsOnTrigger38_2_ExecuteUbergraph_Map_RefProperty; // 0x0818 (size: 0x8)
    class ARedGuy_C* RedGuy12_ExecuteUbergraph_Map_RefProperty;                       // 0x0820 (size: 0x8)
    class ADoor3_C* Door113_ExecuteUbergraph_Map_RefProperty;                         // 0x0828 (size: 0x8)
    class ADoor3_C* Door112_ExecuteUbergraph_Map_RefProperty;                         // 0x0830 (size: 0x8)
    class AWalkPoint_C* WalkPoint426_ExecuteUbergraph_Map_RefProperty;                // 0x0838 (size: 0x8)
    class ATriggerVolume* TriggerVolume76_3_ExecuteUbergraph_Map_RefProperty;         // 0x0840 (size: 0x8)
    class AStaticMeshActor* pipe_206_ExecuteUbergraph_Map_RefProperty;                // 0x0848 (size: 0x8)
    class ATriggerBox* TriggerBox17_ExecuteUbergraph_Map_RefProperty;                 // 0x0850 (size: 0x8)
    class ATriggerBox* TriggerBox_1_ExecuteUbergraph_Map_RefProperty;                 // 0x0858 (size: 0x8)
    class ATaskGoldCounter_C* TaskGoldCounter_2_ExecuteUbergraph_Map_RefProperty;     // 0x0860 (size: 0x8)
    class ARedGuy_C* RedGuy13_3_ExecuteUbergraph_Map_RefProperty;                     // 0x0868 (size: 0x8)
    class ATargetPoint* TargetPoint25_ExecuteUbergraph_Map_RefProperty;               // 0x0870 (size: 0x8)
    class ATargetPoint* TargetPoint26_10_ExecuteUbergraph_Map_RefProperty;            // 0x0878 (size: 0x8)
    class ATargetPoint* TargetPoint27_ExecuteUbergraph_Map_RefProperty;               // 0x0880 (size: 0x8)
    class ATargetPoint* TargetPoint28_ExecuteUbergraph_Map_RefProperty;               // 0x0888 (size: 0x8)
    class ATargetPoint* TargetPoint29_ExecuteUbergraph_Map_RefProperty;               // 0x0890 (size: 0x8)
    class ATargetPoint* TargetPoint30_ExecuteUbergraph_Map_RefProperty;               // 0x0898 (size: 0x8)
    class ATargetPoint* TargetPoint31_ExecuteUbergraph_Map_RefProperty;               // 0x08A0 (size: 0x8)
    class ATargetPoint* TargetPoint32_ExecuteUbergraph_Map_RefProperty;               // 0x08A8 (size: 0x8)
    class ATargetPoint* TargetPoint33_ExecuteUbergraph_Map_RefProperty;               // 0x08B0 (size: 0x8)
    class ATargetPoint* TargetPoint34_ExecuteUbergraph_Map_RefProperty;               // 0x08B8 (size: 0x8)
    class ATargetPoint* TargetPoint35_ExecuteUbergraph_Map_RefProperty;               // 0x08C0 (size: 0x8)
    class ATargetPoint* TargetPoint36_ExecuteUbergraph_Map_RefProperty;               // 0x08C8 (size: 0x8)
    class ATargetPoint* TargetPoint37_ExecuteUbergraph_Map_RefProperty;               // 0x08D0 (size: 0x8)
    class ATargetPoint* TargetPoint38_ExecuteUbergraph_Map_RefProperty;               // 0x08D8 (size: 0x8)
    class ATargetPoint* TargetPoint39_ExecuteUbergraph_Map_RefProperty;               // 0x08E0 (size: 0x8)
    class ATargetPoint* TargetPoint40_ExecuteUbergraph_Map_RefProperty;               // 0x08E8 (size: 0x8)
    class ATargetPoint* TargetPoint41_ExecuteUbergraph_Map_RefProperty;               // 0x08F0 (size: 0x8)
    class ATargetPoint* TargetPoint42_ExecuteUbergraph_Map_RefProperty;               // 0x08F8 (size: 0x8)
    class ATargetPoint* TargetPoint44_ExecuteUbergraph_Map_RefProperty;               // 0x0900 (size: 0x8)
    class ATargetPoint* TargetPoint43_ExecuteUbergraph_Map_RefProperty;               // 0x0908 (size: 0x8)
    class ASmallbuttonOpenClose_C* SmallbuttonOpenClose7_ExecuteUbergraph_Map_RefProperty; // 0x0910 (size: 0x8)
    class ATargetPoint* TargetPoint21_3_ExecuteUbergraph_Map_RefProperty;             // 0x0918 (size: 0x8)
    class ATriggerVolume* UnderCarrotDispenser_ExecuteUbergraph_Map_RefProperty;      // 0x0920 (size: 0x8)
    class ARedGuy_C* BlueCousinHelp3_ExecuteUbergraph_Map_RefProperty;                // 0x0928 (size: 0x8)
    class APointLight* PanicLight_ExecuteUbergraph_Map_RefProperty;                   // 0x0930 (size: 0x8)
    class ARedGuy_C* BlueCousinHelp2_ExecuteUbergraph_Map_RefProperty;                // 0x0938 (size: 0x8)
    class AJumppad_C* Jumppad86_ExecuteUbergraph_Map_RefProperty;                     // 0x0940 (size: 0x8)
    class ALampOn_C* LampOn85_ExecuteUbergraph_Map_RefProperty;                       // 0x0948 (size: 0x8)
    class ALampOn_C* LampOn84_ExecuteUbergraph_Map_RefProperty;                       // 0x0950 (size: 0x8)
    class ALampOn_C* LampOn36_ExecuteUbergraph_Map_RefProperty;                       // 0x0958 (size: 0x8)
    class ALampOn_C* LampOn32_2_ExecuteUbergraph_Map_RefProperty;                     // 0x0960 (size: 0x8)
    class ABigButton_C* BigButton35_2_ExecuteUbergraph_Map_RefProperty;               // 0x0968 (size: 0x8)
    class AStaticMeshActor* Stylized_shit3_ExecuteUbergraph_Map_RefProperty;          // 0x0970 (size: 0x8)
    class AStaticMeshActor* Stylized_shit4_ExecuteUbergraph_Map_RefProperty;          // 0x0978 (size: 0x8)
    class AEmitter* SupraballShitSmoke_2_ExecuteUbergraph_Map_RefProperty;            // 0x0980 (size: 0x8)
    class AEmitter* SupraballShitSmoke2_ExecuteUbergraph_Map_RefProperty;             // 0x0988 (size: 0x8)
    class AEmitter* ShitSplash_2_ExecuteUbergraph_Map_RefProperty;                    // 0x0990 (size: 0x8)
    class AEmitter* ShitSplash2_ExecuteUbergraph_Map_RefProperty;                     // 0x0998 (size: 0x8)
    class ATaskGiveKey_C* TaskGiveKey_2_ExecuteUbergraph_Map_RefProperty;             // 0x09A0 (size: 0x8)
    class ARedGuy_C* HintGuy14_ExecuteUbergraph_Map_RefProperty;                      // 0x09A8 (size: 0x8)
    class ARedGuy_C* HintGuy15_ExecuteUbergraph_Map_RefProperty;                      // 0x09B0 (size: 0x8)
    class ARedGuy_C* BlueCousinHelp5_ExecuteUbergraph_Map_RefProperty;                // 0x09B8 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook23_2_ExecuteUbergraph_Map_RefProperty;   // 0x09C0 (size: 0x8)
    class ATargetPoint* TargetPoint46_3_ExecuteUbergraph_Map_RefProperty;             // 0x09C8 (size: 0x8)
    class AFatty_C* Fatty_2_ExecuteUbergraph_Map_RefProperty;                         // 0x09D0 (size: 0x8)
    class APipeCap_C* PipeCap7_2_ExecuteUbergraph_Map_RefProperty;                    // 0x09D8 (size: 0x8)
    class ACardboard_C* Cardboard22_ExecuteUbergraph_Map_RefProperty;                 // 0x09E0 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook25_2_ExecuteUbergraph_Map_RefProperty;   // 0x09E8 (size: 0x8)
    class ATargetPoint* TargetPoint47_3_ExecuteUbergraph_Map_RefProperty;             // 0x09F0 (size: 0x8)
    class ADoorStone_C* Door130_ExecuteUbergraph_Map_RefProperty;                     // 0x09F8 (size: 0x8)
    class ADoor3_C* Door105_ExecuteUbergraph_Map_RefProperty;                         // 0x0A00 (size: 0x8)
    class ADoor_C* Door118_2_ExecuteUbergraph_Map_RefProperty;                        // 0x0A08 (size: 0x8)
    class ADoorStone_C* Door128_ExecuteUbergraph_Map_RefProperty;                     // 0x0A10 (size: 0x8)
    class ADoorStone_C* Door129_ExecuteUbergraph_Map_RefProperty;                     // 0x0A18 (size: 0x8)
    class APipeCap_C* PipeCap26_ExecuteUbergraph_Map_RefProperty;                     // 0x0A20 (size: 0x8)
    class AUpgradeHappiness_C* UpgradeHappiness2_2_ExecuteUbergraph_Map_RefProperty;  // 0x0A28 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent5_5_ExecuteUbergraph_Map_RefProperty;            // 0x0A30 (size: 0x8)
    class AShowHideSaveObject_C* ShowBigBoy_ExecuteUbergraph_Map_RefProperty;         // 0x0A38 (size: 0x8)
    class ARedGuyEvent_C* MomSpawning_ExecuteUbergraph_Map_RefProperty;               // 0x0A40 (size: 0x8)
    class ARedGuyEvent_C* OtherguySpawning_ExecuteUbergraph_Map_RefProperty;          // 0x0A48 (size: 0x8)
    class ARedGuy_C* Mom5_ExecuteUbergraph_Map_RefProperty;                           // 0x0A50 (size: 0x8)
    class AWalkPoint_C* WalkPoint415_ExecuteUbergraph_Map_RefProperty;                // 0x0A58 (size: 0x8)
    class ARedGuy_C* RedGuy95_8_ExecuteUbergraph_Map_RefProperty;                     // 0x0A60 (size: 0x8)
    class ATriggerVolume_C* TriggerVolume53_6_ExecuteUbergraph_Map_RefProperty;       // 0x0A68 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent6_2_ExecuteUbergraph_Map_RefProperty;            // 0x0A70 (size: 0x8)
    class ADoor_C* Door93_ExecuteUbergraph_Map_RefProperty;                           // 0x0A78 (size: 0x8)
    class ARedGuy_C* Mom7_ExecuteUbergraph_Map_RefProperty;                           // 0x0A80 (size: 0x8)
    class ARedGuy_C* Mom6_ExecuteUbergraph_Map_RefProperty;                           // 0x0A88 (size: 0x8)
    class ADoor_C* Door107_ExecuteUbergraph_Map_RefProperty;                          // 0x0A90 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent11_ExecuteUbergraph_Map_RefProperty;             // 0x0A98 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent10_ExecuteUbergraph_Map_RefProperty;             // 0x0AA0 (size: 0x8)
    class ADoor3_C* Door109_2_ExecuteUbergraph_Map_RefProperty;                       // 0x0AA8 (size: 0x8)
    class ARedGuy_C* BlueKing1_ExecuteUbergraph_Map_RefProperty;                      // 0x0AB0 (size: 0x8)
    class ADoor3_C* Door110_ExecuteUbergraph_Map_RefProperty;                         // 0x0AB8 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume33Castle_ExecuteUbergraph_Map_RefProperty; // 0x0AC0 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook5_2_ExecuteUbergraph_Map_RefProperty;    // 0x0AC8 (size: 0x8)
    class AShowHideSaveObject_C* ShowBigBoy3_ExecuteUbergraph_Map_RefProperty;        // 0x0AD0 (size: 0x8)
    class AWalkPoint_C* WalkPoint412_ExecuteUbergraph_Map_RefProperty;                // 0x0AD8 (size: 0x8)
    class AStaticMeshActor* pencil5_ExecuteUbergraph_Map_RefProperty;                 // 0x0AE0 (size: 0x8)
    class AStaticMeshActor* Volcanic_Rock_2136_ExecuteUbergraph_Map_RefProperty;      // 0x0AE8 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume33Castle3_ExecuteUbergraph_Map_RefProperty; // 0x0AF0 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume33Castle4_ExecuteUbergraph_Map_RefProperty; // 0x0AF8 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume33Castle5_ExecuteUbergraph_Map_RefProperty; // 0x0B00 (size: 0x8)
    class APipeCap_C* PipeCap21_2_ExecuteUbergraph_Map_RefProperty;                   // 0x0B08 (size: 0x8)
    class AWalkPoint_C* WalkPoint425_ExecuteUbergraph_Map_RefProperty;                // 0x0B10 (size: 0x8)
    class ATriggerVolume_C* TriggerVolume74_2_ExecuteUbergraph_Map_RefProperty;       // 0x0B18 (size: 0x8)
    class ARedGuy_C* Mom4_ExecuteUbergraph_Map_RefProperty;                           // 0x0B20 (size: 0x8)
    class ATeslaCoil_C* TeslaCoil23_ExecuteUbergraph_Map_RefProperty;                 // 0x0B28 (size: 0x8)
    class ABuyChestDetector_C* BuyChestDetector_30_ExecuteUbergraph_Map_RefProperty;  // 0x0B30 (size: 0x8)
    class ARedGuy_C* BlueShopKeeper2_ExecuteUbergraph_Map_RefProperty;                // 0x0B38 (size: 0x8)
    class ABigButtonWeight_C* BigButtonWeight_2_ExecuteUbergraph_Map_RefProperty;     // 0x0B40 (size: 0x8)
    class ARedGuy_C* StompHIntGuy_ExecuteUbergraph_Map_RefProperty;                   // 0x0B48 (size: 0x8)
    class ARedGuy_C* BlueCousinHelp6_ExecuteUbergraph_Map_RefProperty;                // 0x0B50 (size: 0x8)
    class ARedGuy_C* RedGuy111_ExecuteUbergraph_Map_RefProperty;                      // 0x0B58 (size: 0x8)
    class ATriggerVolume_C* TriggerVolume117_ExecuteUbergraph_Map_RefProperty;        // 0x0B60 (size: 0x8)
    class ATargetPoint* TargetPoint24_3_ExecuteUbergraph_Map_RefProperty;             // 0x0B68 (size: 0x8)
    class ATriggerVolume_C* TriggerVolume94_2_ExecuteUbergraph_Map_RefProperty;       // 0x0B70 (size: 0x8)
    class ARedGuy_C* BlueGuy3_ExecuteUbergraph_Map_RefProperty;                       // 0x0B78 (size: 0x8)
    class AMoonSlot_C* MoonSlot_2_ExecuteUbergraph_Map_RefProperty;                   // 0x0B80 (size: 0x8)
    class AMoonSlot_C* MoonSlot2_ExecuteUbergraph_Map_RefProperty;                    // 0x0B88 (size: 0x8)
    class ARisingBeam_C* RisingBeam3_5_ExecuteUbergraph_Map_RefProperty;              // 0x0B90 (size: 0x8)
    class ARisingBeam_C* RisingBeam4_ExecuteUbergraph_Map_RefProperty;                // 0x0B98 (size: 0x8)
    class ADoor_C* Door104_ExecuteUbergraph_Map_RefProperty;                          // 0x0BA0 (size: 0x8)
    class AMusicChangeVolume_C* MusicChangeVolume2_ExecuteUbergraph_Map_RefProperty;  // 0x0BA8 (size: 0x8)
    class ACounterTrigger2_C* CounterTrigger2_3_ExecuteUbergraph_Map_RefProperty;     // 0x0BB0 (size: 0x8)
    class ARedGuy_C* RedGuy43_3062_ExecuteUbergraph_Map_RefProperty;                  // 0x0BB8 (size: 0x8)
    class ATriggeredBlockingVolume_C* TriggeredBlockingVolume24_ExecuteUbergraph_Map_RefProperty; // 0x0BC0 (size: 0x8)
    class ADestroyObjectSaved_C* DestroyObjectSaved3_ExecuteUbergraph_Map_RefProperty; // 0x0BC8 (size: 0x8)
    class ASetLastCheckpoint_C* SetLastCheckpoint85_ExecuteUbergraph_Map_RefProperty; // 0x0BD0 (size: 0x8)
    class ABreakGlass_C* BreakGlass_2_ExecuteUbergraph_Map_RefProperty;               // 0x0BD8 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook21_2_ExecuteUbergraph_Map_RefProperty;   // 0x0BE0 (size: 0x8)
    class ABuyTripleJump_C* BuyTripleJump_877_ExecuteUbergraph_Map_RefProperty;       // 0x0BE8 (size: 0x8)
    class ABuyDoubleJump_C* BuyDoubleJump_786_ExecuteUbergraph_Map_RefProperty;       // 0x0BF0 (size: 0x8)
    class ABuyForceBlock_C* BuyForceBlock_695_ExecuteUbergraph_Map_RefProperty;       // 0x0BF8 (size: 0x8)
    class ABuyHealth+15_C* BuyHealth+15_765_ExecuteUbergraph_Map_RefProperty;         // 0x0C00 (size: 0x8)
    class ARedGuy_C* RedGuy_476_ExecuteUbergraph_Map_RefProperty;                     // 0x0C08 (size: 0x8)
    class ARedGuy_C* ShowFCBarrelGuy_ExecuteUbergraph_Map_RefProperty;                // 0x0C10 (size: 0x8)
    class ASmallbutton_C* Smallbutton_2237_ExecuteUbergraph_Map_RefProperty;          // 0x0C18 (size: 0x8)
    class ASmallbutton_C* Smallbutton3_ExecuteUbergraph_Map_RefProperty;              // 0x0C20 (size: 0x8)
    class ASmallbutton_C* Smallbutton2_ExecuteUbergraph_Map_RefProperty;              // 0x0C28 (size: 0x8)
    class ABuyHealthRegen_C* BuyHealthRegen2_695_ExecuteUbergraph_Map_RefProperty;    // 0x0C30 (size: 0x8)
    class ABarrelClosed_Blueprint_C* BarrelClosed2_2_ExecuteUbergraph_Map_RefProperty; // 0x0C38 (size: 0x8)
    class ARedGuy_C* ShowBarrelsGuy_ExecuteUbergraph_Map_RefProperty;                 // 0x0C40 (size: 0x8)
    class ARedGuy_C* ShowDJBarrelGuy_ExecuteUbergraph_Map_RefProperty;                // 0x0C48 (size: 0x8)
    class ATutorialButtons_C* TutorialButtons8_3061_ExecuteUbergraph_Map_RefProperty; // 0x0C50 (size: 0x8)
    class ATutorialButtons_C* TutorialButtons9_ExecuteUbergraph_Map_RefProperty;      // 0x0C58 (size: 0x8)
    class AGoldenBarrelCounter1_C* GoldenBarrelCounter1_466_ExecuteUbergraph_Map_RefProperty; // 0x0C60 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook6_ExecuteUbergraph_Map_RefProperty;      // 0x0C68 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook9_ExecuteUbergraph_Map_RefProperty;      // 0x0C70 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook10_ExecuteUbergraph_Map_RefProperty;     // 0x0C78 (size: 0x8)
    class ASmallbutton_C* Smallbutton26_ExecuteUbergraph_Map_RefProperty;             // 0x0C80 (size: 0x8)
    class ATriggerVolume* TriggerVolume21_6_ExecuteUbergraph_Map_RefProperty;         // 0x0C88 (size: 0x8)
    class ATargetPoint* TargetPoint3_3_ExecuteUbergraph_Map_RefProperty;              // 0x0C90 (size: 0x8)
    class AWalkPoint_C* WalkPointOutside2_ExecuteUbergraph_Map_RefProperty;           // 0x0C98 (size: 0x8)
    class AWalkPoint_C* WalkPointDoorOutside_ExecuteUbergraph_Map_RefProperty;        // 0x0CA0 (size: 0x8)
    class AWalkPoint_C* WalkPointDoorInside_ExecuteUbergraph_Map_RefProperty;         // 0x0CA8 (size: 0x8)
    class AWalkPoint_C* WalkPointInside2_ExecuteUbergraph_Map_RefProperty;            // 0x0CB0 (size: 0x8)
    class AWalkPoint_C* WalkPointInside1_ExecuteUbergraph_Map_RefProperty;            // 0x0CB8 (size: 0x8)
    class ARedGuy_C* CheckGuy_ExecuteUbergraph_Map_RefProperty;                       // 0x0CC0 (size: 0x8)
    class ADoor3_C* Door12_378_ExecuteUbergraph_Map_RefProperty;                      // 0x0CC8 (size: 0x8)
    class ARedGuy_C* LetMeInGuy_ExecuteUbergraph_Map_RefProperty;                     // 0x0CD0 (size: 0x8)
    class ATargetPoint* TargetPoint5_3_ExecuteUbergraph_Map_RefProperty;              // 0x0CD8 (size: 0x8)
    class ATriggerVolume* TriggerVolume23_6_ExecuteUbergraph_Map_RefProperty;         // 0x0CE0 (size: 0x8)
    class ADoor_C* Door13_2872_ExecuteUbergraph_Map_RefProperty;                      // 0x0CE8 (size: 0x8)
    class ATriggeredBlockingVolume_C* TriggeredBlockingVolume18_4_ExecuteUbergraph_Map_RefProperty; // 0x0CF0 (size: 0x8)
    class ADestroyObjectsOnTrigger_C* DestroyObjectsOnTrigger6_2_ExecuteUbergraph_Map_RefProperty; // 0x0CF8 (size: 0x8)
    class ARingRusty_C* RingRusty4_ExecuteUbergraph_Map_RefProperty;                  // 0x0D00 (size: 0x8)
    class ARingRusty_C* RingRusty2_502_ExecuteUbergraph_Map_RefProperty;              // 0x0D08 (size: 0x8)
    class ATriggerVolume* CheckKeycards_ExecuteUbergraph_Map_RefProperty;             // 0x0D10 (size: 0x8)
    class ATargetPoint* TargetPoint17_3_ExecuteUbergraph_Map_RefProperty;             // 0x0D18 (size: 0x8)
    class ATriggerVolume* TriggerVolume13_3_ExecuteUbergraph_Map_RefProperty;         // 0x0D20 (size: 0x8)
    class ATargetPoint* TargetPoint18_3_ExecuteUbergraph_Map_RefProperty;             // 0x0D28 (size: 0x8)
    class ALevelSequenceActor* Intro_ExecuteUbergraph_Map_RefProperty;                // 0x0D30 (size: 0x8)
    class ASkeletalMeshActor* Boy_ExecuteUbergraph_Map_RefProperty;                   // 0x0D38 (size: 0x8)
    class ASkeletalMeshActor* Boy2_ExecuteUbergraph_Map_RefProperty;                  // 0x0D40 (size: 0x8)
    class ARedGuy_C* RedGuy125_ExecuteUbergraph_Map_RefProperty;                      // 0x0D48 (size: 0x8)
    class ARedGuy_C* RedGuy7_ExecuteUbergraph_Map_RefProperty;                        // 0x0D50 (size: 0x8)
    class ARedGuy_C* RedGuy126_ExecuteUbergraph_Map_RefProperty;                      // 0x0D58 (size: 0x8)
    class ARedGuy_C* RedGuy127_ExecuteUbergraph_Map_RefProperty;                      // 0x0D60 (size: 0x8)
    class ARedGuy_C* RedGuy128_ExecuteUbergraph_Map_RefProperty;                      // 0x0D68 (size: 0x8)
    class ARedGuy_C* RedGuy129_ExecuteUbergraph_Map_RefProperty;                      // 0x0D70 (size: 0x8)
    class ATriggerVolume* TriggerVolume26_3_ExecuteUbergraph_Map_RefProperty;         // 0x0D78 (size: 0x8)
    class ARedGuy_C* BlueGuy_ExecuteUbergraph_Map_RefProperty;                        // 0x0D80 (size: 0x8)
    class AStaticMeshActor* Bar_ExecuteUbergraph_Map_RefProperty;                     // 0x0D88 (size: 0x8)
    class AWalkPoint_C* WalkPoint35_590_ExecuteUbergraph_Map_RefProperty;             // 0x0D90 (size: 0x8)
    class AWalkPoint_C* WalkPoint36_ExecuteUbergraph_Map_RefProperty;                 // 0x0D98 (size: 0x8)
    class AWalkPoint_C* WalkPoint38_ExecuteUbergraph_Map_RefProperty;                 // 0x0DA0 (size: 0x8)
    class AWalkPoint_C* WalkPoint37_ExecuteUbergraph_Map_RefProperty;                 // 0x0DA8 (size: 0x8)
    class AWalkPoint_C* WalkPoint39_ExecuteUbergraph_Map_RefProperty;                 // 0x0DB0 (size: 0x8)
    class ADoor3_C* Door28_ExecuteUbergraph_Map_RefProperty;                          // 0x0DB8 (size: 0x8)
    class ADoor3_C* Door27_1724_ExecuteUbergraph_Map_RefProperty;                     // 0x0DC0 (size: 0x8)
    class AButton_C* Button5_512_ExecuteUbergraph_Map_RefProperty;                    // 0x0DC8 (size: 0x8)
    class ABuyGunAlt_C* BuyGunAlt_478_ExecuteUbergraph_Map_RefProperty;               // 0x0DD0 (size: 0x8)
    class AWalkPoint_C* WalkPoint40_ExecuteUbergraph_Map_RefProperty;                 // 0x0DD8 (size: 0x8)
    class ARedGuy_C* RedGuy51_12305_ExecuteUbergraph_Map_RefProperty;                 // 0x0DE0 (size: 0x8)
    class AWalkPoint_C* WalkPoint41_ExecuteUbergraph_Map_RefProperty;                 // 0x0DE8 (size: 0x8)
    class ARedGuy_C* CousinRot_ExecuteUbergraph_Map_RefProperty;                      // 0x0DF0 (size: 0x8)
    class ADoor3_C* Door31_ExecuteUbergraph_Map_RefProperty;                          // 0x0DF8 (size: 0x8)
    class APaperSpriteActor* ShockrifleInfo_Sprite_2_ExecuteUbergraph_Map_RefProperty; // 0x0E00 (size: 0x8)
    class ADoor3_C* Door106_ExecuteUbergraph_Map_RefProperty;                         // 0x0E08 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook13_9_ExecuteUbergraph_Map_RefProperty;   // 0x0E10 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook14_ExecuteUbergraph_Map_RefProperty;     // 0x0E18 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook15_ExecuteUbergraph_Map_RefProperty;     // 0x0E20 (size: 0x8)
    class ASteelBarMelt_C* SteelBarMelt18_ExecuteUbergraph_Map_RefProperty;           // 0x0E28 (size: 0x8)
    class AWalkPoint_C* WalkPoint484_ExecuteUbergraph_Map_RefProperty;                // 0x0E30 (size: 0x8)
    class ARedGuy_C* RedGuy49_ExecuteUbergraph_Map_RefProperty;                       // 0x0E38 (size: 0x8)
    class ARedGuy_C* RedGuy48_ExecuteUbergraph_Map_RefProperty;                       // 0x0E40 (size: 0x8)
    class ARedGuy_C* RedGuy47_ExecuteUbergraph_Map_RefProperty;                       // 0x0E48 (size: 0x8)
    class ARedGuy_C* RedGuy45_2552_ExecuteUbergraph_Map_RefProperty;                  // 0x0E50 (size: 0x8)
    class ADestroyObjectsOnTrigger_C* DestroyObjectsOnTrigger27_2_ExecuteUbergraph_Map_RefProperty; // 0x0E58 (size: 0x8)
    class ABuySwordCriticalDamageChance_C* BuySwordCriticalDamageChance2_2395_ExecuteUbergraph_Map_RefProperty; // 0x0E60 (size: 0x8)
    class ABuyShieldBreaker_C* BuyShieldBreaker_1026_ExecuteUbergraph_Map_RefProperty; // 0x0E68 (size: 0x8)
    class ABuyGunRefillSpeed+66_C* BuyGunRefillSpeed+66_478_ExecuteUbergraph_Map_RefProperty; // 0x0E70 (size: 0x8)
    class ABuyGunCriticalDamageChance_C* BuyGunCriticalDamageChance2_1856_ExecuteUbergraph_Map_RefProperty; // 0x0E78 (size: 0x8)
    class ARedGuy_C* trump_ExecuteUbergraph_Map_RefProperty;                          // 0x0E80 (size: 0x8)
    class ARedGuy_C* RedGuy56_3362_ExecuteUbergraph_Map_RefProperty;                  // 0x0E88 (size: 0x8)
    class ABarrelRed_C* BarrelClosed17_ExecuteUbergraph_Map_RefProperty;              // 0x0E90 (size: 0x8)
    class ABuyHealth+15_C* BuyHealth+16_457_ExecuteUbergraph_Map_RefProperty;         // 0x0E98 (size: 0x8)
    class ABuyGunSpeedx2_C* BuyGunSpeedx2_436_ExecuteUbergraph_Map_RefProperty;       // 0x0EA0 (size: 0x8)
    class ABuyGunDamage+15_C* BuyGunDamage+15_1234_ExecuteUbergraph_Map_RefProperty;  // 0x0EA8 (size: 0x8)
    class ABuyGunRefireRate50_C* BuyGunRefireRate50_506_ExecuteUbergraph_Map_RefProperty; // 0x0EB0 (size: 0x8)
    class ARedGuy_C* RedGuy37_ExecuteUbergraph_Map_RefProperty;                       // 0x0EB8 (size: 0x8)
    class ABuyGunRefillSpeed+66_C* BuySilentFeet2_ExecuteUbergraph_Map_RefProperty;   // 0x0EC0 (size: 0x8)
    class ARedBarrelCounter_C* RedBarrelCounter_470_ExecuteUbergraph_Map_RefProperty; // 0x0EC8 (size: 0x8)
    class ABuySwordDamage+3_C* UpgradeSwordDamageX2_716_ExecuteUbergraph_Map_RefProperty; // 0x0ED0 (size: 0x8)
    class ARedGuy_C* RedGuy64_ExecuteUbergraph_Map_RefProperty;                       // 0x0ED8 (size: 0x8)
    class AStaticMeshActor* crate_planks_separated_Crate_plank02_mesh105_600_ExecuteUbergraph_Map_RefProperty; // 0x0EE0 (size: 0x8)
    class ASkeletalMeshActor* Boy3_ExecuteUbergraph_Map_RefProperty;                  // 0x0EE8 (size: 0x8)
    class ARedGuy_C* RedGuy73_5634_ExecuteUbergraph_Map_RefProperty;                  // 0x0EF0 (size: 0x8)
    class ATriggerVolume* TriggerVolume36_ExecuteUbergraph_Map_RefProperty;           // 0x0EF8 (size: 0x8)
    class AStaticMeshActor* Pickaxe6_3571_ExecuteUbergraph_Map_RefProperty;           // 0x0F00 (size: 0x8)
    class ARedGuy_C* RedGuy81_ExecuteUbergraph_Map_RefProperty;                       // 0x0F08 (size: 0x8)
    class ADoor3_C* Door82_ExecuteUbergraph_Map_RefProperty;                          // 0x0F10 (size: 0x8)
    class ATriggerVolume* TriggerVolume38_ExecuteUbergraph_Map_RefProperty;           // 0x0F18 (size: 0x8)
    class AStaticMeshActor* BarrelClosed20_2042_ExecuteUbergraph_Map_RefProperty;     // 0x0F20 (size: 0x8)
    class ARingColorer_C* RingColorer3_ExecuteUbergraph_Map_RefProperty;              // 0x0F28 (size: 0x8)
    class ARedGuy_C* RedGuy80_ExecuteUbergraph_Map_RefProperty;                       // 0x0F30 (size: 0x8)
    class ARedGuy_C* RedGuy75_ExecuteUbergraph_Map_RefProperty;                       // 0x0F38 (size: 0x8)
    class ARedGuy_C* RedGuy76_ExecuteUbergraph_Map_RefProperty;                       // 0x0F40 (size: 0x8)
    class ARedGuy_C* RedGuy78_ExecuteUbergraph_Map_RefProperty;                       // 0x0F48 (size: 0x8)
    class AMusicEngine_C* MusicEngine_329_ExecuteUbergraph_Map_RefProperty;           // 0x0F50 (size: 0x8)
    class ATargetPoint* TargetPoint13_9_ExecuteUbergraph_Map_RefProperty;             // 0x0F58 (size: 0x8)
    class ATriggerVolume* TriggerVolume47_ExecuteUbergraph_Map_RefProperty;           // 0x0F60 (size: 0x8)
    class ATriggerVolume* TriggerVolume48_ExecuteUbergraph_Map_RefProperty;           // 0x0F68 (size: 0x8)
    class ATargetPoint* TargetPoint14_12_ExecuteUbergraph_Map_RefProperty;            // 0x0F70 (size: 0x8)
    class ATriggerVolume* TriggerVolume49_ExecuteUbergraph_Map_RefProperty;           // 0x0F78 (size: 0x8)
    class ATargetPoint* TargetPoint11_3_ExecuteUbergraph_Map_RefProperty;             // 0x0F80 (size: 0x8)
    class ATriggerVolume* TriggerVolume50_ExecuteUbergraph_Map_RefProperty;           // 0x0F88 (size: 0x8)
    class ASmallbuttonMultipleActors_C* SmallbuttonMultipleActors46_3752_ExecuteUbergraph_Map_RefProperty; // 0x0F90 (size: 0x8)
    class ATutorialButtons_C* TutorialButtons18_630_ExecuteUbergraph_Map_RefProperty; // 0x0F98 (size: 0x8)
    class ACrystal_C* Crystal23_ExecuteUbergraph_Map_RefProperty;                     // 0x0FA0 (size: 0x8)
    class ARedGuy_C* RedGuy88_ExecuteUbergraph_Map_RefProperty;                       // 0x0FA8 (size: 0x8)
    class ADoor_C* Door76_ExecuteUbergraph_Map_RefProperty;                           // 0x0FB0 (size: 0x8)
    class ARedGuy_C* RedGuy65_ExecuteUbergraph_Map_RefProperty;                       // 0x0FB8 (size: 0x8)
    class AShowHideSaveObject_C* ShowHideSaveObject_2_ExecuteUbergraph_Map_RefProperty; // 0x0FC0 (size: 0x8)
    class ARingRusty_C* RingRusty14_ExecuteUbergraph_Map_RefProperty;                 // 0x0FC8 (size: 0x8)
    class AMinecraftBrick_C* MinecraftBrick52_ExecuteUbergraph_Map_RefProperty;       // 0x0FD0 (size: 0x8)
    class AJumppad_C* Jumppad67_ExecuteUbergraph_Map_RefProperty;                     // 0x0FD8 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook28_161_ExecuteUbergraph_Map_RefProperty; // 0x0FE0 (size: 0x8)
    class ATriggerVolume_C* TriggerVolume182_2_ExecuteUbergraph_Map_RefProperty;      // 0x0FE8 (size: 0x8)
    class AJumppad_C* Jumppad60_ExecuteUbergraph_Map_RefProperty;                     // 0x0FF0 (size: 0x8)
    class ASmallbutton_C* Smallbutton4_1668_ExecuteUbergraph_Map_RefProperty;         // 0x0FF8 (size: 0x8)
    class AEmitter* BuildDone_5_ExecuteUbergraph_Map_RefProperty;                     // 0x1000 (size: 0x8)
    class AExponentialHeightFog* ExponentialHeightFog_1_ExecuteUbergraph_Map_RefProperty; // 0x1008 (size: 0x8)
    class ADoorPhysical_C* DoorPhysical2_1520_ExecuteUbergraph_Map_RefProperty;       // 0x1010 (size: 0x8)
    class ATriggerBox* TriggerBox10_4_ExecuteUbergraph_Map_RefProperty;               // 0x1018 (size: 0x8)
    class ATriggerBox* TriggerBox16_ExecuteUbergraph_Map_RefProperty;                 // 0x1020 (size: 0x8)
    class ABallistaRadius_C* BallistaRadius_2186_ExecuteUbergraph_Map_RefProperty;    // 0x1028 (size: 0x8)
    class ARedGuy_C* CliffJumpGuy_ExecuteUbergraph_Map_RefProperty;                   // 0x1030 (size: 0x8)
    class ARedGuy_C* Supraball_Character45_ExecuteUbergraph_Map_RefProperty;          // 0x1038 (size: 0x8)
    class ARedGuy_C* Supraball_Character18_ExecuteUbergraph_Map_RefProperty;          // 0x1040 (size: 0x8)
    class ARedGuy_C* Supraball_Character17_ExecuteUbergraph_Map_RefProperty;          // 0x1048 (size: 0x8)
    class ARedGuy_C* Supraball_Character16_ExecuteUbergraph_Map_RefProperty;          // 0x1050 (size: 0x8)
    class AStaticMeshActor* Fence14_ExecuteUbergraph_Map_RefProperty;                 // 0x1058 (size: 0x8)
    class ABlockingVolume* BlockingVolume20_3_ExecuteUbergraph_Map_RefProperty;       // 0x1060 (size: 0x8)
    class ABlockingVolume* BlockingVolume21_ExecuteUbergraph_Map_RefProperty;         // 0x1068 (size: 0x8)
    class ABlockingVolume* BlockingVolume22_ExecuteUbergraph_Map_RefProperty;         // 0x1070 (size: 0x8)
    class ABlockingVolume* BlockingVolume23_ExecuteUbergraph_Map_RefProperty;         // 0x1078 (size: 0x8)
    class ABlockingVolume* BlockingVolume24_ExecuteUbergraph_Map_RefProperty;         // 0x1080 (size: 0x8)
    class ABlockingVolume* BlockingVolume25_ExecuteUbergraph_Map_RefProperty;         // 0x1088 (size: 0x8)
    class ARedGuy_C* Supraball_Character5_ExecuteUbergraph_Map_RefProperty;           // 0x1090 (size: 0x8)
    class ARedGuy_C* Supraball_Character2_ExecuteUbergraph_Map_RefProperty;           // 0x1098 (size: 0x8)
    class ARedGuy_C* Supraball_Character4_ExecuteUbergraph_Map_RefProperty;           // 0x10A0 (size: 0x8)
    class ARedGuy_C* Supraball_Character30_ExecuteUbergraph_Map_RefProperty;          // 0x10A8 (size: 0x8)
    class ARedGuy_C* Supraball_Character39_ExecuteUbergraph_Map_RefProperty;          // 0x10B0 (size: 0x8)
    class ARedGuy_C* Supraball_Character28_ExecuteUbergraph_Map_RefProperty;          // 0x10B8 (size: 0x8)
    class ARedGuy_C* Supraball_Character20_ExecuteUbergraph_Map_RefProperty;          // 0x10C0 (size: 0x8)
    class ARedGuy_C* Supraball_Character22_ExecuteUbergraph_Map_RefProperty;          // 0x10C8 (size: 0x8)
    class ATriggerBox* TriggerBox20_3_ExecuteUbergraph_Map_RefProperty;               // 0x10D0 (size: 0x8)
    class ABuySword_C* BuySword_695_ExecuteUbergraph_Map_RefProperty;                 // 0x10D8 (size: 0x8)
    class ARedGuy_C* RedGuy26_762_ExecuteUbergraph_Map_RefProperty;                   // 0x10E0 (size: 0x8)
    class ARedGuy_C* RedGuy22_1262_ExecuteUbergraph_Map_RefProperty;                  // 0x10E8 (size: 0x8)
    class ARedGuy_C* ShowRedCrystalWayWallGuy_ExecuteUbergraph_Map_RefProperty;       // 0x10F0 (size: 0x8)
    class ARedGuy_C* RedGuy15_20204_ExecuteUbergraph_Map_RefProperty;                 // 0x10F8 (size: 0x8)
    class AButton_C* Button2_800_ExecuteUbergraph_Map_RefProperty;                    // 0x1100 (size: 0x8)
    class ARedGuy_C* RedGuy30_1618_ExecuteUbergraph_Map_RefProperty;                  // 0x1108 (size: 0x8)
    class ARedGuy_C* ShowRedCrystalGuy2_ExecuteUbergraph_Map_RefProperty;             // 0x1110 (size: 0x8)
    class ARedGuy_C* DoubleJumpGuy_ExecuteUbergraph_Map_RefProperty;                  // 0x1118 (size: 0x8)
    class AJumppad_C* Jumppad15_762_ExecuteUbergraph_Map_RefProperty;                 // 0x1120 (size: 0x8)
    class ALift1_C* Lift4_920_ExecuteUbergraph_Map_RefProperty;                       // 0x1128 (size: 0x8)
    class ARedGuy_C* RedGuy57_5667_ExecuteUbergraph_Map_RefProperty;                  // 0x1130 (size: 0x8)
    class ARedGuy_C* HintGuy_ExecuteUbergraph_Map_RefProperty;                        // 0x1138 (size: 0x8)
    class ASkeletalMeshActor* Supraball_Character41_ExecuteUbergraph_Map_RefProperty; // 0x1140 (size: 0x8)
    class AStaticMeshActor* hammer3_2407_ExecuteUbergraph_Map_RefProperty;            // 0x1148 (size: 0x8)
    class ASkeletalMeshActor* Supraball_Character36_91_ExecuteUbergraph_Map_RefProperty; // 0x1150 (size: 0x8)
    class ABlockingVolume* BlockingVolume65_ExecuteUbergraph_Map_RefProperty;         // 0x1158 (size: 0x8)
    class ABlockingVolume* BlockingVolume66_ExecuteUbergraph_Map_RefProperty;         // 0x1160 (size: 0x8)
    class ABlockingVolume* BlockingVolume64_4_ExecuteUbergraph_Map_RefProperty;       // 0x1168 (size: 0x8)
    class ATutorialButtons_C* TutorialButtons6_ExecuteUbergraph_Map_RefProperty;      // 0x1170 (size: 0x8)
    class ARedGuy_C* Mom2_ExecuteUbergraph_Map_RefProperty;                           // 0x1178 (size: 0x8)
    class ARedGuy_C* Mom3_ExecuteUbergraph_Map_RefProperty;                           // 0x1180 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent_32_ExecuteUbergraph_Map_RefProperty;            // 0x1188 (size: 0x8)
    class ADoorStone_C* Door6_3665_ExecuteUbergraph_Map_RefProperty;                  // 0x1190 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent3_1748_ExecuteUbergraph_Map_RefProperty;         // 0x1198 (size: 0x8)
    class APipeCap_C* PipeCap10_2_ExecuteUbergraph_Map_RefProperty;                   // 0x11A0 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent2_569_ExecuteUbergraph_Map_RefProperty;          // 0x11A8 (size: 0x8)
    class ALever_C* Lever_194_ExecuteUbergraph_Map_RefProperty;                       // 0x11B0 (size: 0x8)
    class AStaticMeshActor* Cartoon_plank_01_26_ExecuteUbergraph_Map_RefProperty;     // 0x11B8 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook3_6_ExecuteUbergraph_Map_RefProperty;    // 0x11C0 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook4_ExecuteUbergraph_Map_RefProperty;      // 0x11C8 (size: 0x8)
    class ARedGuy_C* Mom8_ExecuteUbergraph_Map_RefProperty;                           // 0x11D0 (size: 0x8)
    class ARedGuy_C* Mom1_ExecuteUbergraph_Map_RefProperty;                           // 0x11D8 (size: 0x8)
    class ACrystalSocket_C* CrystalSocket_2_ExecuteUbergraph_Map_RefProperty;         // 0x11E0 (size: 0x8)
    class ARedGuy_C* RedGuy27_ExecuteUbergraph_Map_RefProperty;                       // 0x11E8 (size: 0x8)
    class AButton_C* Button_702_ExecuteUbergraph_Map_RefProperty;                     // 0x11F0 (size: 0x8)
    class ABigButton_C* BigButton7_13333_ExecuteUbergraph_Map_RefProperty;            // 0x11F8 (size: 0x8)
    class ADemoOverActor_C* DemoOverActor_2_ExecuteUbergraph_Map_RefProperty;         // 0x1200 (size: 0x8)
    class ATriggeredBlockingVolume_C* BlockBlueVille_ExecuteUbergraph_Map_RefProperty; // 0x1208 (size: 0x8)
    class ADoorStone_C* Door125_ExecuteUbergraph_Map_RefProperty;                     // 0x1210 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent14_ExecuteUbergraph_Map_RefProperty;             // 0x1218 (size: 0x8)
    class ADoor_C* Door122_ExecuteUbergraph_Map_RefProperty;                          // 0x1220 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent13_ExecuteUbergraph_Map_RefProperty;             // 0x1228 (size: 0x8)
    class ARedGuy_C* BlueCousinHelp_ExecuteUbergraph_Map_RefProperty;                 // 0x1230 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent12_2_ExecuteUbergraph_Map_RefProperty;           // 0x1238 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent15_ExecuteUbergraph_Map_RefProperty;             // 0x1240 (size: 0x8)
    class AStaticMeshActor* Pipe_flange101_ExecuteUbergraph_Map_RefProperty;          // 0x1248 (size: 0x8)
    class AStaticMeshActor* Pipe_flange100_289_ExecuteUbergraph_Map_RefProperty;      // 0x1250 (size: 0x8)
    class Achest_C* Chest72_2_ExecuteUbergraph_Map_RefProperty;                       // 0x1258 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook16_2_ExecuteUbergraph_Map_RefProperty;   // 0x1260 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook17_ExecuteUbergraph_Map_RefProperty;     // 0x1268 (size: 0x8)
    class ACutSceneMode_C* CutSceneMode2_ExecuteUbergraph_Map_RefProperty;            // 0x1270 (size: 0x8)
    class ASteelBarMelt_C* SteelBarMelt16_ExecuteUbergraph_Map_RefProperty;           // 0x1278 (size: 0x8)
    class ASteelBarMelt_C* SteelBarMelt15_ExecuteUbergraph_Map_RefProperty;           // 0x1280 (size: 0x8)
    class ARedGuy_C* RedGuy42_ExecuteUbergraph_Map_RefProperty;                       // 0x1288 (size: 0x8)
    class ARedGuy_C* RedGuy50_ExecuteUbergraph_Map_RefProperty;                       // 0x1290 (size: 0x8)
    class ARedGuy_C* RedGuy46_ExecuteUbergraph_Map_RefProperty;                       // 0x1298 (size: 0x8)
    class ARedGuyEvent_C* RedGuyEvent9_3_ExecuteUbergraph_Map_RefProperty;            // 0x12A0 (size: 0x8)
    class ATutorialButtons_C* TutorialButtons29_5_ExecuteUbergraph_Map_RefProperty;   // 0x12A8 (size: 0x8)
    class AShowText_C* ShowText_2_ExecuteUbergraph_Map_RefProperty;                   // 0x12B0 (size: 0x8)
    class AShowText_C* ShowText6_ExecuteUbergraph_Map_RefProperty;                    // 0x12B8 (size: 0x8)
    class AShowText_C* ShowText2_ExecuteUbergraph_Map_RefProperty;                    // 0x12C0 (size: 0x8)
    class AMusicChangeVolumeNew_C* MusicChangeRedTown_ExecuteUbergraph_Map_RefProperty; // 0x12C8 (size: 0x8)
    class AKey_C* Key2_ExecuteUbergraph_Map_RefProperty;                              // 0x12D0 (size: 0x8)
    class ATriggeredBlockingVolume_C* TriggeredBlockingVolume21_ExecuteUbergraph_Map_RefProperty; // 0x12D8 (size: 0x8)
    class ATriggeredBlockingVolume_C* demoblock_ExecuteUbergraph_Map_RefProperty;     // 0x12E0 (size: 0x8)
    class ATriggeredBlockingVolume_C* ChapelOOBBlock_ExecuteUbergraph_Map_RefProperty; // 0x12E8 (size: 0x8)
    class ATriggeredBlockingVolume_C* TriggeredBlockingVolume22_6_ExecuteUbergraph_Map_RefProperty; // 0x12F0 (size: 0x8)
    class ARedGuy_C* CubeHintGuy_ExecuteUbergraph_Map_RefProperty;                    // 0x12F8 (size: 0x8)
    class ARedGuy_C* Dontdoubt_ExecuteUbergraph_Map_RefProperty;                      // 0x1300 (size: 0x8)
    class Achest_C* Chest76_ExecuteUbergraph_Map_RefProperty;                         // 0x1308 (size: 0x8)
    class ATriggeredBlockingVolume_C* CarrotJumppadButtonBlock_ExecuteUbergraph_Map_RefProperty; // 0x1310 (size: 0x8)
    class ATaskGetTheGraves_C* TaskGetTheGraves_218_ExecuteUbergraph_Map_RefProperty; // 0x1318 (size: 0x8)
    class AEmitter* Butterflywhite14_ExecuteUbergraph_Map_RefProperty;                // 0x1320 (size: 0x8)
    class ADoor2_C* Door35_938_ExecuteUbergraph_Map_RefProperty;                      // 0x1328 (size: 0x8)
    class APointLight* PointLight_29_ExecuteUbergraph_Map_RefProperty;                // 0x1330 (size: 0x8)
    class ADoor_C* Door4_642_ExecuteUbergraph_Map_RefProperty;                        // 0x1338 (size: 0x8)
    class AQuestActivator_C* QuestActivator2_2_ExecuteUbergraph_Map_RefProperty;      // 0x1340 (size: 0x8)
    class ARedGuy_C* Magician_ExecuteUbergraph_Map_RefProperty;                       // 0x1348 (size: 0x8)
    class ARedGuy_C* SpectatorKid1_ExecuteUbergraph_Map_RefProperty;                  // 0x1350 (size: 0x8)
    class ARedGuy_C* SpectatorKid3_ExecuteUbergraph_Map_RefProperty;                  // 0x1358 (size: 0x8)
    class ARedGuy_C* SpectatorKid4_ExecuteUbergraph_Map_RefProperty;                  // 0x1360 (size: 0x8)
    class ARedGuy_C* SpectatorKid2_ExecuteUbergraph_Map_RefProperty;                  // 0x1368 (size: 0x8)
    class ARedGuy_C* SpectatorKid5_ExecuteUbergraph_Map_RefProperty;                  // 0x1370 (size: 0x8)
    class AMoveMesh_C* OpenBox1_ExecuteUbergraph_Map_RefProperty;                     // 0x1378 (size: 0x8)
    class AMoveMesh_C* OpenBox2_ExecuteUbergraph_Map_RefProperty;                     // 0x1380 (size: 0x8)
    class APlayerForceLook_C* PlayerForceLook26_2_ExecuteUbergraph_Map_RefProperty;   // 0x1388 (size: 0x8)
    class ATriggerVolume* Box1Trigger3_ExecuteUbergraph_Map_RefProperty;              // 0x1390 (size: 0x8)
    class ATriggerVolume* Box1Trigger4_ExecuteUbergraph_Map_RefProperty;              // 0x1398 (size: 0x8)
    class AGiveAchievement_C* GiveAchievement_2_ExecuteUbergraph_Map_RefProperty;     // 0x13A0 (size: 0x8)
    class ADoorStone_C* Door3_892_ExecuteUbergraph_Map_RefProperty;                   // 0x13A8 (size: 0x8)
    class Achest_C* Chest137_ExecuteUbergraph_Map_RefProperty;                        // 0x13B0 (size: 0x8)
    class Achest_C* Chest136_3_ExecuteUbergraph_Map_RefProperty;                      // 0x13B8 (size: 0x8)
    class AEffectTriggerable_C* EffectTriggerable_2_ExecuteUbergraph_Map_RefProperty; // 0x13C0 (size: 0x8)

    void IsCurrentlyActive(bool& IsActive);
    void DetectEnemiesInRegionAndSpawnSome3(int32 Region);
    void DetectEnemiesInRegionAndSpawnSome2(int32 Region);
    void DestroyActorcomponentsSave(class AActor* Actor, class UActorComponent* Components);
    void DetectOwnRegion(int32& Region);
    void DetectEnemiesInRegionAndSpawnSome(int32 Region);
    void Timeline_8__FinishedFunc();
    void Timeline_8__UpdateFunc();
    void Timeline_7__FinishedFunc();
    void Timeline_7__UpdateFunc();
    void Timeline_9__FinishedFunc();
    void Timeline_9__UpdateFunc();
    void Timeline_14__FinishedFunc();
    void Timeline_14__UpdateFunc();
    void Timeline_15__FinishedFunc();
    void Timeline_15__UpdateFunc();
    void Timeline_16__FinishedFunc();
    void Timeline_16__UpdateFunc();
    void Timeline_17__FinishedFunc();
    void Timeline_17__UpdateFunc();
