#ifndef UE4SS_SDK_RedGuySettings_HPP
#define UE4SS_SDK_RedGuySettings_HPP

struct FRedGuySettings
{
    class AActor* RedGuy_2_F8C026FE48A3E5892A4210816B7DDF90;                          // 0x0000 (size: 0x8)
    int32 TextStatus_5_C2F023504D402E64380A629D5E431A9C;                              // 0x0008 (size: 0x4)
    int32 TalkSound_7_8F5DB5034D863BBA00769B8832168A44;                               // 0x000C (size: 0x4)
    bool ShowsSomething?_9_D3E12BA24590E62E5B0479BCF54DD7DE;                          // 0x0010 (size: 0x1)
    class AActor* ShowThis_12_CB15EDF5458E250C38D67AB78BE88148;                       // 0x0018 (size: 0x8)
    bool Visible_17_C7B0A5654739FBDA182DD786646D14B2;                                 // 0x0020 (size: 0x1)
    bool Wave_16_9C3A1A404705533ACDCE0495E89FE931;                                    // 0x0021 (size: 0x1)
    bool TalkWhenPlayerClose_31_594416BE4EC810743646E78352D4AC1B;                     // 0x0022 (size: 0x1)
    bool Alwayslookatplayer_34_A27BD135418363CF858ECFA0916CCE5A;                      // 0x0023 (size: 0x1)
    bool Neverlookatplayer_36_7622B5E54CFAA5F8BA55B78A269ABA9C;                       // 0x0024 (size: 0x1)
    bool Keeptextonscreen_38_49FC466847A3EC142D7B3D81A52CE2FE;                        // 0x0025 (size: 0x1)
    FName CurrentDynamicTextStatus_41_9C3956C64EA79598BBD5968CE3B570CB;               // 0x0028 (size: 0x8)
    bool Canbeinterrupted_46_242E154542AE747A296C198EBCEF9F21;                        // 0x0030 (size: 0x1)
    bool Interruptsothers_47_2478E3E84E480533B9EBBB9C3C623DE9;                        // 0x0031 (size: 0x1)

}; // Size: 0x32

#endif
