#ifndef UE4SS_SDK_Saving_HPP
#define UE4SS_SDK_Saving_HPP

class USaving_C : public USaveGame
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0028 (size: 0x8)
    FString SaveSlotName;                                                             // 0x0030 (size: 0x10)
    TArray<class AActor*> ThingsToRemove;                                             // 0x0040 (size: 0x10)
    TArray<class AActor*> ThingsToActivate;                                           // 0x0050 (size: 0x10)
    TArray<class AActor*> ThingsToOpenForever;                                        // 0x0060 (size: 0x10)
    int32 PlayerProgressPoints;                                                       // 0x0070 (size: 0x4)
    bool PlayerHasSword;                                                              // 0x0074 (size: 0x1)
    bool PlayerHasSpeedx2;                                                            // 0x0075 (size: 0x1)
    bool PlayerHasForceCube;                                                          // 0x0076 (size: 0x1)
    bool PlayerHasForceCubeTelefrag;                                                  // 0x0077 (size: 0x1)
    bool PlayerHasMultijump1;                                                         // 0x0078 (size: 0x1)
    bool PlayerHasMultijump2;                                                         // 0x0079 (size: 0x1)
    bool PlayerHasGun;                                                                // 0x007A (size: 0x1)
    bool PlayerHasGunAlt;                                                             // 0x007B (size: 0x1)
    bool PlayerHasBelt;                                                               // 0x007C (size: 0x1)
    bool PlayerHasGrapple;                                                            // 0x007D (size: 0x1)
    bool PlayerHasSmashDown;                                                          // 0x007E (size: 0x1)
    bool PlayerHasShield;                                                             // 0x007F (size: 0x1)
    bool PlayerHasTranslocator;                                                       // 0x0080 (size: 0x1)
    bool PlayerHasSwordKillGrave1;                                                    // 0x0081 (size: 0x1)
    bool PlayerHasSwordKillGrave2;                                                    // 0x0082 (size: 0x1)
    bool PlayerHasSwordDamagex2;                                                      // 0x0083 (size: 0x1)
    bool PlayerHasSwordCriticalDamage;                                                // 0x0084 (size: 0x1)
    float SwordCriticalDamageChance;                                                  // 0x0088 (size: 0x4)
    float SwordCriticalDamageAmount;                                                  // 0x008C (size: 0x4)
    bool PlayerHasSeeChestNum;                                                        // 0x0090 (size: 0x1)
    bool PlayerHasSeeGraveNum;                                                        // 0x0091 (size: 0x1)
    bool PlayerSilentFeet;                                                            // 0x0092 (size: 0x1)
    bool PlayerHasDamageNumberRising;                                                 // 0x0093 (size: 0x1)
    float SwordRefireRate;                                                            // 0x0094 (size: 0x4)
    int32 SwordDamage;                                                                // 0x0098 (size: 0x4)
    float PlayerHealth;                                                               // 0x009C (size: 0x4)
    float PlayerMaxHealth;                                                            // 0x00A0 (size: 0x4)
    bool PlayerHealthRegen;                                                           // 0x00A4 (size: 0x1)
    int32 PlayerHealthRegenToX;                                                       // 0x00A8 (size: 0x4)
    float PlayerHealthRegenSpeed;                                                     // 0x00AC (size: 0x4)
    float PlayerNonSensingMultiplier;                                                 // 0x00B0 (size: 0x4)
    float PlayerLootHealthLuck;                                                       // 0x00B4 (size: 0x4)
    float PlayerArmor;                                                                // 0x00B8 (size: 0x4)
    int32 PlayerCoins;                                                                // 0x00BC (size: 0x4)
    int32 PlayerMaxCoins;                                                             // 0x00C0 (size: 0x4)
    float PlayerGunRefireRate;                                                        // 0x00C4 (size: 0x4)
    float PlayerProjectile1Damage;                                                    // 0x00C8 (size: 0x4)
    float PlayerProjectile1Speed;                                                     // 0x00CC (size: 0x4)
    float PlayerProjectile1Radius;                                                    // 0x00D0 (size: 0x4)
    int32 PlayerShells;                                                               // 0x00D4 (size: 0x4)
    FVector Player Position;                                                          // 0x00D8 (size: 0xC)
    TArray<FRedGuySettings> AllNPCSettings;                                           // 0x00E8 (size: 0x10)
    bool PlayerTutorialDone;                                                          // 0x00F8 (size: 0x1)
    bool PlayerShowProgressPoints;                                                    // 0x00F9 (size: 0x1)
    bool PlayerShowHealthBar;                                                         // 0x00FA (size: 0x1)
    int32 PlayerDeathCount;                                                           // 0x00FC (size: 0x4)
    float PlayerGunAltRefireRate;                                                     // 0x0100 (size: 0x4)
    bool PlayerHasChestDetector;                                                      // 0x0104 (size: 0x1)
    float PlayerGunAltDamage;                                                         // 0x0108 (size: 0x4)
    int32 PlayerRedCrystals;                                                          // 0x010C (size: 0x4)
    bool PlayerHasGunCriticalDamage;                                                  // 0x0110 (size: 0x1)
    float GunCriticalDamageChance;                                                    // 0x0114 (size: 0x4)
    float PlayerSmashDownDamage;                                                      // 0x0118 (size: 0x4)
    bool PlayerGunPicksUpCoins;                                                       // 0x011C (size: 0x1)
    bool PlayerEnemiesLoot;                                                           // 0x011D (size: 0x1)
    bool PlayerInvertLookUp;                                                          // 0x011E (size: 0x1)
    bool PlayerForceCubeStomp;                                                        // 0x011F (size: 0x1)
    float PlayerSmashDownRadius;                                                      // 0x0120 (size: 0x4)
    float PlayerMouseSens;                                                            // 0x0124 (size: 0x4)
    bool PlayerCoinMagnet;                                                            // 0x0128 (size: 0x1)
    bool PlayerShieldBreaker;                                                         // 0x0129 (size: 0x1)
    float PlayerSwordRange;                                                           // 0x012C (size: 0x4)
    float PlayerAmmoRegenSpeed;                                                       // 0x0130 (size: 0x4)
    bool PlayerDoubleHealth;                                                          // 0x0134 (size: 0x1)
    bool PlayerGunKillGrave1;                                                         // 0x0135 (size: 0x1)
    bool PlayerGunKillGrave2;                                                         // 0x0136 (size: 0x1)
    bool PlayerStrong;                                                                // 0x0137 (size: 0x1)
    FText Quest;                                                                      // 0x0138 (size: 0x18)
    bool PlayerDrankHealthPlusJuice;                                                  // 0x0150 (size: 0x1)
    float PlayerComboDamage;                                                          // 0x0154 (size: 0x4)
    bool PlayerGrappleForceCube;                                                      // 0x0158 (size: 0x1)
    bool PlayerGrappleGold;                                                           // 0x0159 (size: 0x1)
    int32 PlayerColor;                                                                // 0x015C (size: 0x4)
    int32 PlayerStolenCoins;                                                          // 0x0160 (size: 0x4)
    float PlayerGameTime;                                                             // 0x0164 (size: 0x4)
    bool PlayerTwistOver;                                                             // 0x0168 (size: 0x1)
    int32 PlayerRedCoins;                                                             // 0x016C (size: 0x4)
    float PlayerTranslocatorThrowForce;                                               // 0x0170 (size: 0x4)
    float PlayerTranslocatorDamage;                                                   // 0x0174 (size: 0x4)
    float PlayerTranslocatorCooldown;                                                 // 0x0178 (size: 0x4)
    float PlayerTranslocatorSpawnExplosionSize;                                       // 0x017C (size: 0x4)
    int32 PlayerMoons;                                                                // 0x0180 (size: 0x4)
    class USoundBase* PlayerCurrentMusic;                                             // 0x0188 (size: 0x8)
    bool PlayerHasSword2;                                                             // 0x0190 (size: 0x1)
    bool PlayerHasSpeedx15;                                                           // 0x0191 (size: 0x1)
    bool PlayerEndgame;                                                               // 0x0192 (size: 0x1)
    float PlayerMaxChestRadius;                                                       // 0x0194 (size: 0x4)
    bool PlayerSkillKillGrave3;                                                       // 0x0198 (size: 0x1)
    bool PlayerHappy;                                                                 // 0x0199 (size: 0x1)
    float Percent;                                                                    // 0x019C (size: 0x4)
    bool PlayerHasGraveDetector;                                                      // 0x01A0 (size: 0x1)
    bool PlayerDoubleLoot;                                                            // 0x01A1 (size: 0x1)
    int32 PlayerKilledGrunts;                                                         // 0x01A4 (size: 0x4)
    int32 PlayerKilledWarrior;                                                        // 0x01A8 (size: 0x4)
    int32 PlayerKilledMage;                                                           // 0x01AC (size: 0x4)
    int32 PlayerKilledKings;                                                          // 0x01B0 (size: 0x4)
    int32 PlayerKilledDemonBomb;                                                      // 0x01B4 (size: 0x4)
    int32 PlayerKilledDemonGrunts;                                                    // 0x01B8 (size: 0x4)
    int32 PlayerKilledArchers;                                                        // 0x01BC (size: 0x4)
    int32 PlayerKilledDemonBoss;                                                      // 0x01C0 (size: 0x4)
    int32 PlayerKilledFatty;                                                          // 0x01C4 (size: 0x4)
    int32 PlayerKilledGhoulSimple;                                                    // 0x01C8 (size: 0x4)
    int32 PlayerKilledGhoulBomb;                                                      // 0x01CC (size: 0x4)
    int32 PlayerKilledSkeletonShieldWarrior;                                          // 0x01D0 (size: 0x4)
    int32 PlayerKilledSkeletonMorningStar;                                            // 0x01D4 (size: 0x4)
    int32 PlayerKilledSkeletonMagician;                                               // 0x01D8 (size: 0x4)
    int32 PlayerKilledGolem;                                                          // 0x01DC (size: 0x4)
    int32 PlayerKilledStump;                                                          // 0x01E0 (size: 0x4)
    int32 PlayerJumpCount;                                                            // 0x01E4 (size: 0x4)
    int32 PlayerCubesSpawned;                                                         // 0x01E8 (size: 0x4)
    bool PlayerStats;                                                                 // 0x01EC (size: 0x1)
    bool PlayerForceCubeStompJump;                                                    // 0x01ED (size: 0x1)
    bool PlayerTranslocatorModule;                                                    // 0x01EE (size: 0x1)
    bool PlayerTranslocatorExplosion;                                                 // 0x01EF (size: 0x1)
    float PlayerTranslocatorMassFactor;                                               // 0x01F0 (size: 0x4)
    bool PlayerJumpHeightPlus;                                                        // 0x01F4 (size: 0x1)
    bool PlayerMagnetRepel;                                                           // 0x01F5 (size: 0x1)
    float PlayerMagnetRepelForce;                                                     // 0x01F8 (size: 0x4)
    bool PlayerBeamElastic;                                                           // 0x01FC (size: 0x1)
    int32 PlayerScrap;                                                                // 0x0200 (size: 0x4)
    TEnumAsByte<Loop::Type> PlayerCrashLoop;                                          // 0x0204 (size: 0x1)
    TEnumAsByte<Pickaxe::Type> PlayerHasPickaxe;                                      // 0x0205 (size: 0x1)
    int32 PlayerIron;                                                                 // 0x0208 (size: 0x4)
    int32 PlayerCoal;                                                                 // 0x020C (size: 0x4)
    int32 PlayerSupranium;                                                            // 0x0210 (size: 0x4)
    int32 PlayerDiamonds;                                                             // 0x0214 (size: 0x4)
    bool HasBrokenPipeDetector;                                                       // 0x0218 (size: 0x1)
    int32 PlayerBones;                                                                // 0x021C (size: 0x4)
    TMap<class AActor*, class USaveDataContainer_C*> ActorSaveData;                   // 0x0220 (size: 0x50)
    TMap<class AActor*, class FSaveDataContainerStruct> ActorSaveDataStructs;         // 0x0270 (size: 0x50)
    TMap<class FDateTime, class FString> SavedVersions;                               // 0x02C0 (size: 0x50)
    class AMusicChangeVolumeV2_C* PlayerCurrentMusicVolumeV2;                         // 0x0310 (size: 0x8)
    bool bPlayerHasGoldenShoes;                                                       // 0x0318 (size: 0x1)
    TEnumAsByte<EHatType::Type> playerHat;                                            // 0x0319 (size: 0x1)
    TEnumAsByte<BodyType::Type> playerBodyType;                                       // 0x031A (size: 0x1)
    FDLC2_Specific_SaveGameInformation DLC2_Specific_SaveGameInformation;             // 0x0320 (size: 0x18)
    bool PlayerHasOreDetector;                                                        // 0x0338 (size: 0x1)
    bool PlayerHasFireGun;                                                            // 0x0339 (size: 0x1)
    FElectricityGunStats ElectricityGunStats;                                         // 0x033C (size: 0x24)
    FFireGunStats FireGunStats;                                                       // 0x0360 (size: 0x10)
    bool PlayerHasElectricGun;                                                        // 0x0370 (size: 0x1)
    TEnumAsByte<SmellEnum::Type> PlayerSmell;                                         // 0x0371 (size: 0x1)
    FPlayerMapUnlocks PlayerMapUnlocks;                                               // 0x0374 (size: 0xC)
    TMap<class FString, class FSaveDataContainerStruct> BackupSlots;                  // 0x0380 (size: 0x50)

    void RemoveBackupFromList(const FString& SaveName);
    void AddBackupToList(const FString& SaveName, class USaving_C* SaveData);
    void ConvertSavedActorDataToStructData();
    void ConvertToSaveSlot();
    void Save(class USaveGame* SaveGame, class USaving_C* SavingObject);
    void Load();
    void Activate();
    void ActivateOpenForever();
    void DestroyAllComponents();
    void SaveAndDestroy();
    void LoadSaveData(class USaveDataContainer_C* SaveData);
    void ExecuteUbergraph_Saving(int32 EntryPoint);
}; // Size: 0x3D0

#endif
