#ifndef UE4SS_SDK_SKeyActionSave_HPP
#define UE4SS_SDK_SKeyActionSave_HPP

struct FSKeyActionSave
{
    FString ActionName_27_5885F13F40BEDA6C8B8F749EAEC64BBA;                           // 0x0000 (size: 0x10)
    FString Category_10_6A9C009143C58E50DF299AA2409B06BD;                             // 0x0010 (size: 0x10)
    FString Name_12_284B813542040EB40314D6A629BCF640;                                 // 0x0020 (size: 0x10)
    float Scale_25_55DAC9F048835ECFBB2123B59FBB6835;                                  // 0x0030 (size: 0x4)
    bool Primary_15_7375BAE94E1228E31B871684158CC790;                                 // 0x0034 (size: 0x1)
    FKey KeyInput_26_669892994CD4745AD57CF4BDF708E2A0;                                // 0x0038 (size: 0x18)
    bool NegativeAxis_22_17736552415A5EA125B225BE5B8415AE;                            // 0x0050 (size: 0x1)
    bool EmptyCombination_29_A96B2E8F49C8DDD0067652A02233A112;                        // 0x0051 (size: 0x1)

}; // Size: 0x52

#endif
